InformationRegisters/ВАТСДополнительныеПараметрыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ВАТСДополнительныеПараметрыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьУведомленияПриЗвонках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьРасширеннуюИнформациюПриЗвонках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВАТСДополнительныеПараметрыПользователей/Ext/ManagerModule.bsl
Функция ПолучитьЗначениеПараметра(Пользователь, НаваниеПараметра) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВАТСДополнительныеПараметрыПользователей.ВнутреннийНомер КАК Параметр
		|ИЗ
		|	РегистрСведений.ВАТСДополнительныеПараметрыПользователей КАК ВАТСДополнительныеПараметрыПользователей
		|ГДЕ
		|	ВАТСДополнительныеПараметрыПользователей.Пользователь = &Пользователь";
	
	Если НаваниеПараметра <> "ВнутреннийНомер" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВнутреннийНомер",	НаваниеПараметра);	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Параметр;	
	КонецЦикла;
	Возврат Неопределено;

КонецФункции // ПолучитьЗначениеПараметра()

Функция НайтиПользователя(ВнутреннийНомер) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВАТСДополнительныеПараметрыПользователей.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ВАТСДополнительныеПараметрыПользователей КАК ВАТСДополнительныеПараметрыПользователей
		|ГДЕ
		|	ВАТСДополнительныеПараметрыПользователей.ВнутреннийНомер = &ВнутреннийНомер";
	
	Попытка	
		Номер = Число(ВнутреннийНомер);
	Исключение
		Возврат Неопределено;	
	КонецПопытки;
	
	Запрос.УстановитьПараметр("ВнутреннийНомер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Пользователь;
	КонецЦикла;
	Возврат Неопределено;

КонецФункции // ()
